#+TITLE: Gcp Gcs Access
* check gsutil auth
#+BEGIN_SRC shell
gcloud auth list 2>&1
:
#+END_SRC

#+RESULTS:
#+begin_example
         Credentialed Accounts
ACTIVE             ACCOUNT
,*                  bb@ii.coop

To set the active account, run:
    $ gcloud config set account `ACCOUNT`

#+end_example
* set default project
#+BEGIN_SRC shell
gcloud config set project apisnoop
#+END_SRC

#+RESULTS:
#+begin_example
#+end_example

* create bucket for logs
#+BEGIN_SRC shell
gsutil mb gs://bb-apisnoop-logs 2>&1
:
#+END_SRC

#+RESULTS:
#+begin_example
Creating gs://bb-apisnoop-logs/...
#+end_example

* set pormissions to allow gcs permissions to the bucket
https://download.huihoo.com/google/gdgdevkit/DVD1/developers.google.com/storage/docs/accesslogs.html

#+BEGIN_SRC shell
gsutil acl ch -g cloud-storage-analytics@google.com:W gs://bb-apisnoop-logs/ 2>&1
:
#+END_SRC

#+RESULTS: Initial sans OWNER-role
#+begin_example
CommandException: Failed to set acl for gs://apisnoop-logs/. Please ensure you have OWNER-role access to this resource.
#+end_example

** get logging
#+BEGIN_SRC shell
gsutil logging get gs://apisnoop
#+END_SRC

#+RESULTS:
#+begin_example
{"logBucket": "bb-apisnoop-logs", "logObjectPrefix": "accessLog"}
#+end_example

#+RESULTS: Initial
#+begin_example
gs://apisnoop/ has no logging configuration.
#+end_example
* Enableg logging on the bucket to the bucket
This was the first pass
#+BEGIN_SRC tmate
gsutil logging set on -b gs://bb-apisnoop-logs gs://apisnoop
#+END_SRC

#+RESULTS:
#+begin_example
#+end_example

Pointing it to artifact.apisnoop.appspot.com
#+BEGIN_SRC tmate
gsutil logging set on -b gs://bb-apisnoop-logs -o accessLog gs://artifacts.apisnoop.appspot.com
#+END_SRC

#+RESULTS:
#+begin_example
#+end_example
